{
  "id": 110,
  "displayName": "NSArray of std::vector",
  "username": "NSArrayofstdvec",
  "isBlueVerified": false,
  "followers": 492,
  "following": 914,
  "hitPoints": 32,
  "profilePicUrl": "/pfp/110.jpg",
  "bannerPicUrl": "/banner/110.jpg",
  "fullArtUrl": null,
  "tier": "lowbie",
  "abilityName": "Cloud Herding Confusion",
  "abilityDescription": "Expertly attempts to organize chaotic data streams and sky-high thoughts, but ends up just scattering them further into the cloud abyss.",
  "attackName": "Approximate Mashed Miss",
  "attackDescription": "NSArray of std::vector tries to serve up some instant mashed wisdom, but it’s just a clumpy, dark mess that nobody asked for and everyone regrets.",
  "attackType": "cringe",
  "attackDamage": 15,
  "weaknessType": "roast",
  "weaknessAmount": 20,
  "resistType": "psyop",
  "resistAmount": 10,
  "description": "The user is a lowbie tier with modest hit points reflecting their mid-level engagement and reach. Their tweets often feature ironic commentary on mundane or imperfect tech/software topics, combined with personal life hacks and peculiar humor. Their ability sarcastically mocks their attempts at organizing or clarifying data (inspired by their profile and tweets about 'herding clouds' and 'not holding data well'). The attack targets their penchant for sharing oddly dark, confusing imagery and explanations (notably their tweet about instant mashed potatoes looking awful), which fits the cringe type, poking fun at their awkward, embarrassing style. Their weakness to 'roast' reflects how sharp criticism could hit them hard given their self-deprecating and awkward online persona, while resistance to 'psyop' implies they are less vulnerable to confusing or manipulative content due to their dry and straightforward ironic humor. No furry or LGBTQ+ content was present, so those types were not assigned despite image-heavy tweets. The card balances a lowbie power level with a witty and cutting theme aligned with the user's online presence.",
  "rarity": "Common",
  "holo": false,
  "xId": "1506075307186573313",
  "cardType": "normal"
}