{
  "id": 119,
  "displayName": "MELTEN",
  "username": "meltenx",
  "isBlueVerified": true,
  "followers": 55047,
  "following": 318,
  "hitPoints": 180,
  "profilePicUrl": "/pfp/119.jpg",
  "bannerPicUrl": "/banner/119.jpg",
  "fullArtUrl": "/fullArt/meltenx_119.png",
  "tier": "megabie",
  "abilityName": "Purple Haze Overload",
  "abilityDescription": "MELTEN's endless purple vibes fog the battlefield, making all opponents question their color choices — even when it's obviously better purple.",
  "attackName": "MELTEN's Art Attack",
  "attackDescription": "Unleashes a barrage of high-energy art shares and purple aesthetic posts that bombard the opponent with overwhelming 'culture,' leaving them dazzled and confused by the sheer volume of content.",
  "attackType": "furry",
  "attackDamage": 95,
  "weaknessType": "psyop",
  "weaknessAmount": 75,
  "resistType": "cringe",
  "resistAmount": 90,
  "description": "MELTEN is a megabie-tier user with ultra-rare, holo status, reflected in high hit points (180). The profile and tweets emphasize purple-themed aesthetics, art-sharing culture, and a distinct love for creative visual content, including cat and animal imagery (e.g., gm🐈‍⬛). This justifies the 'furry' attack type as the animal theme is subtle but present. The ability sarcastically highlights their obsession with purple and art culture, with a jab at their over-saturation of this theme. The attack references their high-volume, art-laden posts with big engagement, roasting them for flooding feeds with 'culture overload.' The weakness to 'psyop' matches their susceptibility to confusion and mind games, as their style may not stand against misleading content. Resistance to 'cringe' fits because the user maintains a strong polished aesthetic and handles awkwardness well, showing confident and consistent branding. Overall, the card balances the user's content, image themes, engagement, and personality with nuanced type choices.",
  "rarity": "Ultra Rare",
  "holo": true,
  "xId": "1566764329604726784",
  "cardType": "fullArt"
}