{
  "id": 130,
  "displayName": "Yastrzab",
  "username": "Yastrzab",
  "isBlueVerified": true,
  "followers": 2439,
  "following": 2577,
  "hitPoints": 100,
  "profilePicUrl": "/pfp/130.jpg",
  "bannerPicUrl": "/banner/130.jpg",
  "fullArtUrl": null,
  "tier": "highbie",
  "abilityName": "Deep Tech Musings",
  "abilityDescription": "Yastrzab's endless tech bro philosophy makes opponents question if they're fighting an AI or just a walking Elon Musk quote machine.",
  "attackName": "Sarcastic Garp Slam",
  "attackDescription": "Yastrzab unloads a baffling yet oddly specific 'gm frenzz' energy blast referencing some obscure meme involving 'garp'. It’s so niche and obscure, it leaves opponents wondering if they missed the joke.",
  "attackType": "cringe",
  "attackDamage": 40,
  "weaknessType": "roast",
  "weaknessAmount": 60,
  "resistType": "psyop",
  "resistAmount": 40,
  "description": "Yastrzab is a highbie tier user with a modest following and tweets mostly focused on tech, AI, and some obscure, low-engagement memes. His profile and tweets show a strong tech bro persona with some sarcastic humor and a devotion to Elon Musk references. The ability 'Deep Tech Musings' mocks his tendency to drop cryptic tech philosophy that confuses more than enlightens, reflecting the somewhat niche and inaccessible vibe. The attack 'Sarcastic Garp Slam' lampoons his obscure meme references that only a few get, emphasizing the cringe type due to awkward and niche meme usage. His weakness to 'roast' fits his tech brother arrogance being vulnerable to sharp criticism or honest mockery. He resists 'psyop' because his content is straightforward tech talk not easily misled by manipulative confusing content. No furry or LGBTQ+ content to justify those types. Overall, the card reflects a sarcastic, slightly cringe but thoughtful tech bro personality with moderate hits and a middle-tier attack value.",
  "rarity": "Uncommon",
  "holo": false,
  "xId": "125939221",
  "cardType": "normal"
}