{
  "id": 133,
  "displayName": "Ram",
  "username": "ramxcodes",
  "isBlueVerified": true,
  "followers": 1202,
  "following": 56,
  "hitPoints": 110,
  "profilePicUrl": "/pfp/133.jpg",
  "bannerPicUrl": "/banner/133.jpg",
  "fullArtUrl": null,
  "tier": "highbie",
  "abilityName": "Engineer’s Eternal Debug",
  "abilityDescription": "Ram’s ability to ‘fix bugs’ ironically causes the opponent’s own attacks to glitch and fizzle out, because even Ram can’t fully escape eternal coding headaches.",
  "attackName": "Ram's Rant Roast",
  "attackDescription": "Ram’s savage takedown of the 'follow me back' crowd and his epic ‘imposter syndrome’ thread burns followers with brutal honesty and zero patience.",
  "attackType": "roast",
  "attackDamage": 55,
  "weaknessType": "cringe",
  "weaknessAmount": 45,
  "resistType": "roast",
  "resistAmount": 50,
  "description": "Ram is a highbie tier coder and content creator who posts sharp, witty, and sometimes brutally honest commentary about coding life and social media culture. His ability mocks his perpetual debugging and coding struggles, a sarcastic jab at his engineer identity. His attack draws from his popular posts roasting followers demanding follow-backs and his candid take on imposter syndrome, highlighting his biting sarcasm and sharp social commentary, fitting the 'roast' attack type and strong attack damage for high engagement. He resists criticism well, reflecting his confidence and occasional narcissism on social media, so he resists roast attacks strongly. However, he is weak to cringe-type attacks because his attempts to be cool and insightful can sometimes come off as awkward or over-earnest, exposing him to embarrassing situations. There's no furry or other themed content to use here, so roast and cringe types are most suitable for his personality and behavior. His hitPoints are set to a solid 110 aligning with his 'highbie' tier and consistent activity and follower count over 1k.",
  "rarity": "Rare",
  "holo": false,
  "xId": "1619671569877577729",
  "cardType": "normal"
}