{
  "id": 15,
  "displayName": "andrewyu",
  "username": "andrewcyu",
  "isBlueVerified": true,
  "followers": 4777,
  "following": 965,
  "hitPoints": 130,
  "profilePicUrl": "/pfp/15.jpg",
  "bannerPicUrl": "/banner/15.jpg",
  "fullArtUrl": null,
  "tier": "ultrabie",
  "abilityName": "Acceleration Overdrive",
  "abilityDescription": "andrewyu speeds through tweets with endless enthusiasm, ironically leaving everyone wondering if he forgot to slow down and breathe.",
  "attackName": "Strategic Naivete Strike",
  "attackDescription": "andrewyu hurls his infamous 'strategic naivete' meme attack, tricking himself into thinking doing hard things is just easy work, confusing opponents with his optimistic delusions.",
  "attackType": "psyop",
  "attackDamage": 65,
  "weaknessType": "drama",
  "weaknessAmount": 50,
  "resistType": "psyop",
  "resistAmount": 60,
  "description": "Hit points are set high (130) matching his ultrabie tier and rare holo status reflecting strong presence. The ability mocks his rapid-fire optimistic tweeting style about acceleration and power, ironically pointing out his frenetic pace. The attack pulls from his repeated use and pride in 'strategic naivete,' an ironic self-jab that masks complex ideas as naive optimism, fitting a psyop attack type due to its mind-game effect. He resists psyop (manipulative confusing content) well because he himself uses it, but is weak to drama since direct emotional conflict would disrupt his composed high-energy persona. The description leverages his tech/product engineering background, frequent engagement with AI/robotics themes, and his higher-tier influence with substantial followers and engagement metrics but relatively low likes per tweet, emphasizing conceptual over hit viral content. The lack of animal/furry themed content excludes the furry type despite some robot images. The sarcasm in ability and attack highlights the user's confident but somewhat naive optimistic style.",
  "rarity": "Rare",
  "holo": true,
  "xId": "240381633",
  "cardType": "normal"
}