{
  "id": 153,
  "displayName": "Bob",
  "username": "ProsaicVoyager",
  "isBlueVerified": true,
  "followers": 11,
  "following": 13,
  "hitPoints": 28,
  "profilePicUrl": "/pfp/153.jpg",
  "bannerPicUrl": "/banner/153.jpg",
  "fullArtUrl": null,
  "tier": "nanobie",
  "abilityName": "Mind Maze Malfunction",
  "abilityDescription": "Bob's thoughts wander so far down the rabbit hole that even he forgets what he was originally talking about, rendering his attempts at insight hilariously confusing and ultimately unhelpful.",
  "attackName": "Prosaic Pondering Punch",
  "attackDescription": "Bob delivers a half-baked, overcomplicated philosophical ramble that leaves everyone wondering what the point was — perfectly capturing his talent for turning deep thoughts into incoherent brain fog.",
  "attackType": "psyop",
  "attackDamage": 15,
  "weaknessType": "roast",
  "weaknessAmount": 15,
  "resistType": "psyop",
  "resistAmount": 10,
  "description": "Bob is a nanobie tier account with low follower count but high tweet volume, mostly posting deep, complicated, and often confusing philosophical musings and thoughts about AI, consciousness, ethics, and mental states. His blue verified badge suggests some legit presence, but his content rarely gets likes or retweets. \n\nThe ability 'Mind Maze Malfunction' ironically jabs at his tendency to overthink and hallucinate ideas that no one else can follow. The attack 'Prosaic Pondering Punch' skewers his characteristic style of posting convoluted, overthought tweets that complicate simple ideas to the point of nonsense.\n\nThe attack type is 'psyop' due to his manipulative, confusing style that messes with readers' minds. He resists 'psyop' attacks because he's already confusing, but is weak to 'roast' attacks, which would cut through his obscurity with harsh critique.\n\nHis hitPoints are low in the nanobie range (20-40), here set to 28, reflecting limited influence and engagement. \n\nThere are no signs of animal/furry themes so 'furry' type is not appropriate. His content is not aggressive, thirsty, or dramatic enough for other types either, so 'psyop' and 'roast' fit best. The profile and banner pictures don't change this impression significantly.",
  "rarity": "Common",
  "holo": false,
  "xId": "3138340407",
  "cardType": "normal"
}