{
  "id": 185,
  "displayName": "BrainForge",
  "username": "FrJulienLaurent",
  "isBlueVerified": true,
  "followers": 156,
  "following": 149,
  "hitPoints": 35,
  "profilePicUrl": "/pfp/185.jpg",
  "bannerPicUrl": "/banner/185.jpg",
  "fullArtUrl": null,
  "tier": "nanobie",
  "abilityName": "Eternal Seeker's Overload",
  "abilityDescription": "BrainForge compulsively chases knowledge and wisdom yet ironically ends up wasting tokens on crashing AI, forever stuck in an endless quest for flawless insight that never comes.",
  "attackName": "Moot Point Strike",
  "attackDescription": "BrainForge unleashes a barrage of low-impact moots and retweets that try to sound wise but mostly just contribute to digital noise, draining opponents' patience and attention.",
  "attackType": "psyop",
  "attackDamage": 15,
  "weaknessType": "roast",
  "weaknessAmount": 20,
  "resistType": "psyop",
  "resistAmount": 15,
  "description": "The hitPoints reflect the nanobie tier, giving moderate vitality but nothing high since the account is relatively new with common rarity. The ability mocks the user's self-declared 'Eternal seeker of knowledge and wisdom' profile and their tweets complaining about AI crashes and wasting tokens, ironically highlighting their futile intellectual pursuit. The attack hones in on their frequent retweets and moots (a term they used themselves), which often add little value but attempt to appear profound—aptly classified as a 'psyop' attack for their somewhat confusing and intellectual overlay. They are resistant to psyop due to their focus on knowledge and discussion but weak to roast since cutting criticism and sharp commentary would upset their intellectual facade, exposing their less impactful content. The user does not post animal or furry content, so no furry type is assigned despite some dog story retweets. Overall, this card captures their tone of wistful intellectualism mixed with some frustration and low traction posts.",
  "rarity": "Common",
  "holo": false,
  "xId": "1638489136825769984",
  "cardType": "normal"
}