{
  "id": 216,
  "xId": "1707852450739232769",
  "displayName": "peachey 𔐓",
  "username": "peach2k2",
  "isBlueVerified": true,
  "followers": 3385,
  "following": 997,
  "hitPoints": 130,
  "profilePicUrl": "/pfp/216.jpg",
  "bannerPicUrl": "/banner/216.jpg",
  "fullArtUrl": null,
  "tier": "ultrabie",
  "abilityName": "Lunatic Loop",
  "abilityDescription": "This deranged gamedev continuously spirals into lunacy, causing glitches in sanity and making opponents question if they've entered a bugged simulation.",
  "attackName": "Peachey's Meme Overload",
  "attackDescription": "Unleashes an overwhelming barrage of low-effort shitposts and sardonic memes, crashing your patience and leaving you begging for a patch.",
  "attackType": "cringe",
  "attackDamage": 65,
  "weaknessType": "roast",
  "weaknessAmount": 50,
  "resistType": "psyop",
  "resistAmount": 40,
  "description": "The user is an ultrabie tier with notable influence (3385 followers) and prolific posting of chaotic, often sarcastic content typical of a 'shitposter' and deranged gamedev. Their ability 'Lunatic Loop' reflects their self-described lunacy and chaotic nature seen in tweets filled with bizarre humor and edgy commentary. The attack 'Peachey's Meme Overload' calls out their incessant meme and shitpost flood that tires out others, aligning well with their high like & retweet counts on meme-style content. The attack type is 'cringe' given much of their humor is awkward and chaotic. Their notable sharp comebacks and humorous self-awareness suggest they are weak to sharp criticism ('roast'), which would cut through their chaotic shield. They resist 'psyop' (manipulative misinformation) as their style is more chaotic than calculated manipulation. Their profile and tweet vibe show no animal/furry themes so no 'furry' type is assigned despite the diversity note. Their hit points are toward the upper side of ultrabie (100-150) due to their large engagement and verified status.",
  "rarity": "Rare",
  "holo": false,
  "cardType": "normal"
}