{
  "id": 218,
  "displayName": "Keith",
  "username": "gnukeith",
  "isBlueVerified": true,
  "followers": 12276,
  "following": 262,
  "hitPoints": 180,
  "profilePicUrl": "/pfp/218.jpg",
  "bannerPicUrl": "/banner/218.jpg",
  "fullArtUrl": "/fullArt/gnukeith_218.png",
  "tier": "megabie",
  "abilityName": "Certified Keyboard Traveler",
  "abilityDescription": "Keith's ability to announce every minor travel mishap from lost flights to pillow shortages means opponents get overwhelmed by unsolicited travel drama, clogging their focus with unnecessary details and memes about anxiety.",
  "attackName": "Keith's Squirrel Stare",
  "attackDescription": "Unleashes a bewildering photo attack featuring Keith's intense fixation on a squirrel, confusing enemies with his genuine fascination and turning serious battles into awkward wildlife watching sessions.",
  "attackType": "cringe",
  "attackDamage": 95,
  "weaknessType": "roast",
  "weaknessAmount": 120,
  "resistType": "cringe",
  "resistAmount": 80,
  "description": "Keith is a megabie tier user with high follower count and extensive tweet history, mostly focused on personal travel stories, food, and quirky life moments. The ability mocks his tendency to overshare mundane travel issues, a sarcastic jab at his frequent travel anxiety and complaints. His attack draws from a notable tweet about seeing a squirrel, capturing his awkward and endearing awkwardness that bombards followers with low-stakes content. The cringe attack type fits this well, given his many awkward moments and self-deprecating humor visible in tweets and images. His weakness to roast attacks makes sense because sharp criticism would cut through his oversharing and diminish his charm, while he resists cringe attacks due to familiarity and comfort with awkwardness. The profile pictures and tweets include images of a cat (himself cat-adopted by @uwu_underground) but no furry community or anthro references, so furry is not assigned. Instead, he fits well into cringe type with strong megabie stats.",
  "rarity": "Based Rare",
  "holo": true,
  "xId": "1653923110108688384",
  "cardType": "fullArt"
}