{
  "id": 22,
  "displayName": "special k | ceo of logical fallacios era",
  "username": "specialkdelslay",
  "isBlueVerified": true,
  "followers": 5387,
  "following": 3727,
  "hitPoints": 130,
  "profilePicUrl": "/pfp/22.jpg",
  "bannerPicUrl": "/banner/22.jpg",
  "fullArtUrl": null,
  "tier": "ultrabie",
  "abilityName": "Logical Fallacy CEO",
  "abilityDescription": "Automatically dismisses any argument with a meme, regardless of its relevance or sense, proving logic is just a suggestion.",
  "attackName": "Special K Slays Your Sense",
  "attackDescription": "special k bombards you with dank memes and relentless sarcasm, obliterating your will to argue with confusing code snippets and pointless rants about dev life. Your brain is left buffering indefinitely.",
  "attackType": "roast",
  "attackDamage": 65,
  "weaknessType": "gaslight",
  "weaknessAmount": 60,
  "resistType": "psyop",
  "resistAmount": 70,
  "description": "This user is a high-tier 'ultrabie' rare card with 130 HP reflecting their active and influential presence. The ability mocks their self-proclaimed CEO title and love for logical fallacies, ironically highlighting their tendency to dodge meaningful discourse through memes. The attack cleverly references their 'special k' display name and heavy meme posting plus dev-related sarcasm, roasting their confusing and verbose style that leaves others overwhelmed. They resist 'psyop' since they regularly joke about tech and manipulation, showing comfort in that arena. However, they are weak to 'gaslight' because their reliance on ironic sarcasm and memes can be disrupted by reality-checking and questioning their contradictory statements. No furry or animal themes found despite some use of turtle emojis and frog pics, so that type is not assigned. The roast type suits them best given their sharp, biting commentary and sarcastic personality evident in tweets and profile.",
  "rarity": "Rare",
  "holo": true,
  "xId": "1460106145855520770",
  "cardType": "normal"
}