{
  "id": 230,
  "displayName": "cudaloop",
  "username": "forloopcodes",
  "isBlueVerified": true,
  "followers": 3896,
  "following": 1666,
  "hitPoints": 140,
  "profilePicUrl": "/pfp/230.jpg",
  "bannerPicUrl": "/banner/230.jpg",
  "fullArtUrl": null,
  "tier": "ultrabie",
  "abilityName": "Loop of Life",
  "abilityDescription": "Every time cudaloop tries to finish a sentence, they ironically have to start another one, endlessly looping their content like a broken for loop.",
  "attackName": "Post Spam Slam",
  "attackDescription": "cudaloop floods the timeline with incremental letter posts and constant recruitment snaps, crushing followers' patience with relentless, trivial updates.",
  "attackType": "cringe",
  "attackDamage": 55,
  "weaknessType": "roast",
  "weaknessAmount": 65,
  "resistType": "cringe",
  "resistAmount": 45,
  "description": "cudaloop is an ultrabie tier user with strong hit points reflecting their high activity and follower count. The ability 'Loop of Life' reflects their ongoing Twitter series of adding one letter each day to finish a sentence, ironically trapping them in an infinite loop of posts which is a cringe-worthy commitment. The attack 'Post Spam Slam' targets their behavior of spamming the timeline with minor incremental posts and annoying recruitment tweets, which while somewhat effective, is generally cringe-inducing. Thus, the attack type is 'cringe' with decent damage. They are weak to 'roast' attacks since sharp criticism and biting commentary can cut through their spam and expose the silliness, hence a strong weakness amount. They resist 'cringe' type attacks due to their high tolerance for awkward/out-of-touch posting and spam. The card avoids 'furry' type since despite a parrot mention and goat picture, no furry or anthro themes appear. The sarcastic ability jabs at their pointless posting loops, and the attack name mocks their spammy behavior.",
  "rarity": "Rare",
  "holo": false,
  "xId": "1831452535757910016",
  "cardType": "normal"
}