{
  "id": 238,
  "displayName": "strwb",
  "username": "strwbcom",
  "isBlueVerified": true,
  "followers": 2255,
  "following": 817,
  "hitPoints": 110,
  "profilePicUrl": "/pfp/238.jpg",
  "bannerPicUrl": "/banner/238.jpg",
  "fullArtUrl": null,
  "tier": "highbie",
  "abilityName": "Maximizing Bullshit Value™",
  "abilityDescription": "Strwb magically turns every reasonable discussion into a shareholder meeting where nonsense is king, inflating drama and stock prices alike.",
  "attackName": "Strwb's Son Saga",
  "attackDescription": "Unleashes the eternal complaints about nobody believing Strwb has a son, dragging everyone into an unconvincing soap opera worthy of a B-list tech influencer.",
  "attackType": "drama",
  "attackDamage": 50,
  "weaknessType": "roast",
  "weaknessAmount": 55,
  "resistType": "psyop",
  "resistAmount": 45,
  "description": "Strwb is a high-tier user with a sizable following and blue checkmark, signaling influence and online presence focused around programming, AI, and shitposting. Their profile and tweets show a sarcastic and ironic tone mixed with tech commentary and personal oversharing. The ability mocks their 'maximizing shareholder value' tagline by ironically inflating drama and nonsense, fitting their style of blending serious tech insight with absurdity.\n\nThe attack is based on their frequently referenced personal drama about their son, which is a running joke and source of engagement, making it a perfect roast-worthy 'drama' attack. \n\nWeakness is assigned to 'roast' type because direct sharp criticism and biting commentary would be the effective way to counter their dramatics and self-aggrandizing posts. Resistance to 'psyop' fits as their posts mix memes, irony, and sarcasm that confuse casual readers, making them resistant to confusing mind games.\n\nNo furry content or LGBTQ+ themes are present, so those types are unused despite wide type diversity goals. The selected types match their content well.",
  "rarity": "Uncommon",
  "holo": false,
  "xId": "1848739714141986816",
  "cardType": "normal"
}