{
  "id": 239,
  "xId": "1644739974028316672",
  "displayName": "bone",
  "username": "boneGPT",
  "isBlueVerified": true,
  "followers": 35905,
  "following": 6696,
  "hitPoints": 185,
  "profilePicUrl": "/pfp/239.jpg",
  "bannerPicUrl": "/banner/239.jpg",
  "fullArtUrl": "/fullArt/boneGPT_239.png",
  "tier": "megabie",
  "abilityName": "Founding Founder Syndrome",
  "abilityDescription": "Automatically assumes every business idea is revolutionary and desperately wants to split profits 50/50 because they're the 'idea guy' founder, ignoring all actual work involved.",
  "attackName": "bone-ified Roast",
  "attackDescription": "Unleashes a barrage of brutally honest takes on everyone else's failures, especially popular tweets roasting others, while ironically acting untouchable in their own bubble.",
  "attackType": "roast",
  "attackDamage": 100,
  "weaknessType": "drama",
  "weaknessAmount": 90,
  "resistType": "psyop",
  "resistAmount": 75,
  "description": "This user's megabie tier and verified status grant them high HP and strong attacks. Their ability mocks their frequent business founder braggadocio and entitlement to splits without effort, observed in tweets about 'killer business ideas' and 'idea guys'. Their attack is based on their sharp, heavily retweeted roasts (notably the viral 'funniest thing before getting fired'), showcasing their influence in biting commentary. The roast type fits their sarcastic, critical posting style. However, they are weak to drama, as their high-profile controversial opinions and edgy content likely attract emotional conflicts that could destabilize them. Resistant to psyop reflects their outsider, contrarian stance that resists manipulation or confusion. Despite no explicit furry or LGBTQ+ content, the dog bite story influences the description but not enough to assign fuzzy types. Their profile and tweets project a founder mode, influencer persona with aggressive sarcasm and controversial takes.",
  "rarity": "Legendary",
  "holo": false,
  "cardType": "fullArt"
}