{
  "id": 243,
  "displayName": "Can Vardar",
  "username": "icanvardar",
  "isBlueVerified": true,
  "followers": 5507,
  "following": 658,
  "hitPoints": 140,
  "profilePicUrl": "/pfp/243.jpg",
  "bannerPicUrl": "/banner/243.jpg",
  "fullArtUrl": null,
  "tier": "ultrabie",
  "abilityName": "Founder’s Existential AFK",
  "abilityDescription": "While AFK until mid July, this card randomly ignores opponent attacks citing 'founder duties' and profound detachment from reality.",
  "attackName": "Ubuntu Backfire",
  "attackDescription": "Can Vardar’s favorite Linux nostalgia attack deals self-inflicted frustration damage after glorifying the inevitable return to Ubuntu; a painfully relatable tech tantrum.",
  "attackType": "roast",
  "attackDamage": 70,
  "weaknessType": "psyop",
  "weaknessAmount": 60,
  "resistType": "roast",
  "resistAmount": 70,
  "description": "Can Vardar is a tech founder with an ultra-high tier and a rare holo card reflecting his influential presence (5507 followers, prolific tweet count). The ability mocks his AFK status and founder persona, ironically ignoring attacks as if detached from Twitter action. His attack is a direct roast on his own tech nostalgia obsession with Linux distros, especially the viral tweet about ending up back on Ubuntu—a weak point for himself but a relatable jab at tech culture. The attack type is 'roast' because his content often critiques and jabs at tech trends with biting wit. He's weak to 'psyop' because confusion and mind games undercut his rational tech critiques and founder confidence. Resistant to 'roast' reflecting his tolerance or immunity to sharp criticism, likely due to his heavy use of sarcasm and roasting others. No animal or anthro content found, so no 'furry' assignment. The ability, attack, and types closely match his profile picture, founder vibe, and sarcastic, sharply critical tweet style including the viral Linux posts and tech commentary.",
  "rarity": "Rare",
  "holo": true,
  "xId": "524618848",
  "cardType": "normal"
}