{
  "id": 252,
  "displayName": "Theo - t3.gg",
  "username": "theo",
  "isBlueVerified": true,
  "followers": 224476,
  "following": 3456,
  "hitPoints": 180,
  "profilePicUrl": "/pfp/252.jpg",
  "bannerPicUrl": "/banner/252.jpg",
  "fullArtUrl": "/fullArt/theo_252.png",
  "tier": "megabie",
  "abilityName": "CEO's Crisis Mode",
  "abilityDescription": "Automatically triggers a mob attack when any minor scandal pops up, because nothing screams leadership like public chaos management.",
  "attackName": "Theo's Cancel Cannon",
  "attackDescription": "Unleashes a barrage of callouts and domain extortion exposes that mysteriously cause people to get 'called out' and even fired. Theo doesn't just tweet, he torpedoes reputations with CEO-level authority.",
  "attackType": "drama",
  "attackDamage": 110,
  "weaknessType": "goon",
  "weaknessAmount": 100,
  "resistType": "drama",
  "resistAmount": 90,
  "description": "Theo is a high-profile tech CEO with megabie status reflecting his massive influence and activity (hitPoints at high end of megabie range). His ability sarcastically mocks his penchant for stirring public chaos and 'sending the mob' when drama arises. The attack is based on his tweets exposing and calling out people like 'ishmilly' leading to lockdowns and firings, showcasing his drama mastery with large damage. Since he thrives on controversy and emotional conflicts, he resists drama but is weak to goon types, who represent aggressive direct confrontation that could disrupt his online reign. Despite his polished CEO vibe, the presence of sarcastic jabs and critical commentary suggest he handles criticism with some resistance but not invulnerability. No furry or queer content was observed, so types like furry or gay were not chosen. Overall, the card reflects his leadership trolling style, large follower base, and the high-stakes drama he courts on Twitter.",
  "rarity": "Based Rare",
  "holo": true,
  "xId": "786375418685165568",
  "cardType": "fullArt",
  "disabled": true
}