{
  "id": 260,
  "displayName": "diginova",
  "username": "_diginova",
  "isBlueVerified": true,
  "followers": 702,
  "following": 1378,
  "hitPoints": 32,
  "profilePicUrl": "/pfp/260.jpg",
  "bannerPicUrl": "/banner/260.jpg",
  "fullArtUrl": null,
  "tier": "lowbie",
  "abilityName": "Jack of All Trades, Master of None",
  "abilityDescription": "Diginova tries to do everything from coding to music to art, but ironically accomplishes just enough to keep the hustle going without delivering the epic win.",
  "attackName": "Beta Launch Blunder",
  "attackDescription": "diginova enthusiastically delays shipping their app waiting for the perfect vision, causing user hype to crash harder than their confidence in production releases.",
  "attackType": "cringe",
  "attackDamage": 18,
  "weaknessType": "drama",
  "weaknessAmount": 14,
  "resistType": "psyop",
  "resistAmount": 12,
  "description": "Given diginova's profile as a low-tier builder juggling multiple projects with moderate follower engagement and a tendency to overthink and delay product releases, the hit points are set low (32) to match their 'lowbie' tier. The ability mocks their scattered multitasking nature without real focus. The attack is drawn from their frequent posts about delaying app launches for a better vision, which ironically backfires on their progress, making it a \"cringe\" type reflecting awkward indecision and overthinking. Their tweets show some resistance to confusion tactics (psyop) by relying on logic and calculated regression models but are vulnerable to drama since emotional upheavals and conflicts disturb their workflow and motivation. The presence of tech, coding, and project-building content with no signs of aggressive, manipulative, LGBT, furry, or thirst-related themes excludes those types. Overall, the card represents an underdog tinkerer who struggles between productivity and perfectionism.",
  "rarity": "Common",
  "holo": false,
  "xId": "1290527416616591360",
  "cardType": "normal"
}