{
  "id": 270,
  "displayName": "hue 🎨",
  "username": "huexi_",
  "isBlueVerified": true,
  "followers": 1003,
  "following": 785,
  "hitPoints": 100,
  "profilePicUrl": "/pfp/270.jpg",
  "bannerPicUrl": "/banner/270.jpg",
  "fullArtUrl": null,
  "tier": "highbie",
  "abilityName": "The Divine Creator's Burden",
  "abilityDescription": "Automatically retweets profound advice and deep quotes, then pretends it's original wisdom. Vulnerable to criticism for lacking real originality.",
  "attackName": "Hue's Highbrow Hijack",
  "attackDescription": "Unleashes retweets of high-traction philosophical and motivational tweets, showing off a talent for repackaging others' brilliance as their own. Hits with the subtle sting of pseudo-depth.",
  "attackType": "psyop",
  "attackDamage": 50,
  "weaknessType": "roast",
  "weaknessAmount": 70,
  "resistType": "psyop",
  "resistAmount": 40,
  "description": "Hue 🎨 is a highbie-tier user with just over 1000 followers but a huge favorite count and high engagement on retweets of philosophical, motivational, and AI-related content. Their profile and cover pictures show artistic flair but no furry or animal themes, so 'furry' type is inappropriate. The ability sarcastically jabs at their reliance on retweeting profound-sounding content instead of original posts, making their 'creativity' ironically derivative. The attack is named for their dominant behavior of hijacking popular deep thoughts and rebranding them, an ironic poke at their social media style. The attack type is psyop, because the user posts layered, sometimes cryptic AI and philosophical material that might confuse or manipulate followers intellectually. They resist psyop-type attacks due to their familiarity with complex ideas but are weak to roast for sharp criticism that calls out their lack of originality. Hit points are set at 100 for the highbie tier, and attack damage at 50 within the ultra-range reflecting strong but not dominant influence.",
  "rarity": "Uncommon",
  "holo": false,
  "xId": "1854455012891742208",
  "cardType": "normal"
}