{
  "id": 275,
  "displayName": "Whiteye",
  "username": "LiquidZooo",
  "isBlueVerified": false,
  "followers": 570,
  "following": 103,
  "hitPoints": 35,
  "profilePicUrl": "/pfp/275.jpg",
  "bannerPicUrl": "/banner/275.jpg",
  "fullArtUrl": null,
  "tier": "lowbie",
  "abilityName": "Code Dump Overload",
  "abilityDescription": "Whiteye's relentless brain dumps and chaotic web3 hot takes leave allies overwhelmed and confused, turning their own data into a mess of indecipherable noise.",
  "attackName": "Whiteye's Meme Stream",
  "attackDescription": "Unleashes a barrage of low-engagement, scattered meme-like tweets that confuse enemies more than impress them.",
  "attackType": "psyop",
  "attackDamage": 20,
  "weaknessType": "roast",
  "weaknessAmount": 15,
  "resistType": "psyop",
  "resistAmount": 10,
  "description": "Whiteye is a lowbie tier user focused on tech, programming, and web3 dev content mixed with sporadic personal rants and memes. The profile images and cover art show a casual, slightly chaotic vibe. Their tweets are often low engagement and scattered, showing a somewhat disorganized but enthusiastic persona. This inspired the 'Code Dump Overload' ability, which ironically jabs at their tendency to flood followers with technical jargon and hot takes that lack clear focus. The attack 'Whiteye's Meme Stream' is based on their posting of memes and inside jokes that fail to gain traction or meaningful attention, reflecting weak audience impact but relentless self-promotion. Given their tech and dev focus with confusing posts, 'psyop' fits as attack type, showing how their content can be misleading or disorienting. They resist psyop attacks due to being accustomed to such content. Their weakness is 'roast' attacks, as sharp criticism would cut through their scattered persona. Overall, their low-tier status with moderate followers and inconsistent engagement assigns them a 35 HP lowbie range and a modest attack damage.",
  "rarity": "Common",
  "holo": false,
  "xId": "1280184148682924032",
  "cardType": "normal"
}