{
  "id": 296,
  "displayName": "͏Alps͏",
  "username": "alpaysh",
  "isBlueVerified": true,
  "followers": 1997,
  "following": 1402,
  "hitPoints": 90,
  "profilePicUrl": "/pfp/296.jpg",
  "bannerPicUrl": "/banner/296.jpg",
  "fullArtUrl": null,
  "tier": "highbie",
  "abilityName": "Private Builder Syndrome",
  "abilityDescription": "Pretends to be working in secret but loudly broadcasts half-baked thoughts and notes to the public, confusing friends and foes alike.",
  "attackName": "Alps' Retarded Timeline",
  "attackDescription": "Slams opponents with a blunt declaration that we’re all living in the dumbest timeline ever, leaving zero room for optimism or nuance. Perfect for killing any vibe.",
  "attackType": "psyop",
  "attackDamage": 45,
  "weaknessType": "roast",
  "weaknessAmount": 40,
  "resistType": "psyop",
  "resistAmount": 35,
  "description": "Alps is a highbie user who posts a lot of introspective, cryptic, and somewhat sarcastic content, often questioning reality and sharing chaotic or confusing thoughts. This makes a psyop attack type fitting, especially with their ironic 'retarded timeline' phrase showing they lean into dark, confusing narrative vibes. Their ability mocks their own habit of paradoxically building 'in private' while oversharing publicly, creating an ironic cognitive dissonance. Their attack damage is moderate reflecting decent engagement but not mega-popularity. They resist psyop due to their familiarity with confusing or manipulative discourse but are weak to roast attacks that criticize and expose their ironic posting style. There's no furry or LGBTQ+ content, so those types are not needed. The card’s hit points fall into the mid-range for a highbie tier user with moderate influence and activity. The description also notes the use of some image posts and memes, but the account's vibe is primarily mind-game and introspective sarcasm, suited for psyop and roast interplay.",
  "rarity": "Uncommon",
  "holo": false,
  "xId": "1798789277918351360",
  "cardType": "normal"
}