{
  "id": 50,
  "displayName": "M4rc0𝕏",
  "username": "dreamworks2050",
  "isBlueVerified": true,
  "followers": 2137,
  "following": 2997,
  "hitPoints": 110,
  "profilePicUrl": "/pfp/50.jpg",
  "bannerPicUrl": "/banner/50.jpg",
  "fullArtUrl": null,
  "tier": "highbie",
  "abilityName": "Chief Pizza Flop",
  "abilityDescription": "Automatically delivers a cold slice of disappointment every time you expect insightful AI content — because hey, it's just pizza, not real tech leadership!",
  "attackName": "M4rc0𝕏's Meme-demic",
  "attackDescription": "Unleashes an unstoppable barrage of low-effort, chaotic meme quotes and random viral stuff that barely scratches the surface of anything meaningful, leaving enemies confused and unimpressed.",
  "attackType": "psyop",
  "attackDamage": 50,
  "weaknessType": "roast",
  "weaknessAmount": 60,
  "resistType": "psyop",
  "resistAmount": 50,
  "description": "M4rc0𝕏 is a highbie tier user with moderate followers and many tweets that largely consist of meme quotes, AI references, and chaotic internet culture mixed with some tech hype. Their profile picture with a dragon emoji and AI mention, plus scattered tweet content like viral meme shares and cryptic AI-related content, shows a cryptic, chaotic and somewhat ironic persona. Their ability sarcastically jabs at their 'Chief Pizza Officer' title which contrasts the real tech influence they claim, implying their content is mostly empty hype or disappointment.\n\nThe attack mocks their barrage of meme quotes and viral internet randomness which doesn't amount to serious tech insight but can confuse or overload opponents, fitting a psyop type.\n\nWeakness is assigned to 'roast' because sharp criticism and honest commentary would hit this account hard given the superficial nature of their tweets and hype attempts.\n\nResistance is to 'psyop' due to their own confusing and chaotic posting style, making them immune to similar confusing attacks.\n\nOverall, the card reflects a chaotic meme-heavy content style, ironic self-branding, and moderate influence with a tech veneer that often falls flat.",
  "rarity": "Uncommon",
  "holo": false,
  "xId": "42126490",
  "cardType": "normal"
}