{
  "id": 70,
  "displayName": "alcuin ❄️",
  "username": "scheminglunatic",
  "isBlueVerified": true,
  "followers": 5399,
  "following": 1162,
  "hitPoints": 130,
  "profilePicUrl": "/pfp/70.png",
  "bannerPicUrl": "/banner/70.jpg",
  "fullArtUrl": null,
  "tier": "ultrabie",
  "abilityName": "Immutable Laziness",
  "abilityDescription": "Alcuin's pure and immutable laziness makes them resist any attempt at productivity or urgency, shrugging off tasks like a pro procrastinator immune to deadlines.",
  "attackName": "Scheming Spambot",
  "attackDescription": "alcuin ❄️ floods your timeline with a chaotic barrage of cryptic hashtags, obscure memes, and hyperfixation rants that confuse and bore their followers into submission.",
  "attackType": "psyop",
  "attackDamage": 65,
  "weaknessType": "roast",
  "weaknessAmount": 70,
  "resistType": "psyop",
  "resistAmount": 60,
  "description": "Alcuin is an ultrabie tier user, reflected in the high hit points (130). Their profile and tweet content shows a mix of cryptic, hyperfixated, and somewhat chaotic posting style filled with obscure references and ironic hashtags, making their ability 'Immutable Laziness' a sarcastic jab at their pure, lazy self-description and constant procrastination/evasive behavior seen in tweets about chores and bureaucracy mixed with deep intellectual content. \n\nThe attack 'Scheming Spambot' mocks their tendency to flood timelines with confusing, esoteric content and heavy hashtag use, causing mental overload - fitting for a 'psyop' attack type because their posts seem designed to confuse or overwhelm followers with obscure or coded messages.\n\nWeakness is 'roast' because sharp criticism and straightforward commentary likely pierce through their dense and ironic veneer, while resistance to 'psyop' fits as they themselves employ confusing and manipulative style posts.\n\nNo furry or LGBTQ+ content is evident, so those types were not chosen despite some images and cryptic emojis. The attack damage and hit points fit an ultrabie user with rare rarity and verified status.",
  "rarity": "Rare",
  "holo": true,
  "xId": "1836490059417006081",
  "cardType": "normal"
}