{
  "id": 8,
  "displayName": "Khar Musk",
  "username": "KharCapital",
  "isBlueVerified": true,
  "followers": 1491,
  "following": 815,
  "hitPoints": 110,
  "profilePicUrl": "/pfp/8.jpg",
  "bannerPicUrl": "/banner/8.jpg",
  "fullArtUrl": null,
  "tier": "highbie",
  "abilityName": "Algorithmic Autopilot",
  "abilityDescription": "Automatically deploys layers of jargon and tech buzzwords to confuse and impress, while ironically sounding like a malfunctioning AI stuck in repetitive loops.",
  "attackName": "Khar Musk Roast",
  "attackDescription": "Unleashes a barrage of sarcasm and condescending remarks on topics from AI to politics, exposing the thin veil of 'insight' with brutal honesty that stings even the loyal followers.",
  "attackType": "roast",
  "attackDamage": 50,
  "weaknessType": "drama",
  "weaknessAmount": 60,
  "resistType": "psyop",
  "resistAmount": 50,
  "description": "Khar Musk's card is designed around his highbie tier with hitPoints in the mid-range reflecting moderate influence and activity. His ability mocks his tech-heavy, jargon-laden tweets that ironically come off as confused autopilot rather than clear insight. The attack pulls from his sarcastic, often condescending tone that criticizes everything from politics to tech, perfected in his tweet insults like 'How does this man manage to be wrong consistently'. The attack type is 'roast' due to his sharp, biting commentary style. He resists 'psyop' types because his technical insights and factual approach make misleading tactics less effective. However, he is weak to 'drama' because his confrontational style and critical posts can provoke emotional conflicts that destabilize him. His profile picture and banner are serious and technological, reinforcing the AI/autonomy theme. Tweets include critical business, political, and tech analyses, often with a sarcastic jab—no animal or furry content, so no furry type assigned.",
  "rarity": "Uncommon",
  "holo": false,
  "xId": "1850292050555748352",
  "cardType": "normal"
}